In [ ]:
#pandas
import pandas as pd
#pandas is defines as a open source library that provides
#high-performance data manipulation in python
#Data analysis requires lot of processing such an restructing,cleaning,mergin,manipulating etc...We prefer Pandas to
#perform above functionalities coz it is fast,simple than other tools.
#pandas is built on numpy,numpy is required for operating pandas.

In [ ]:
#Pandas series
#pandas series s a data structure with one
#dimensional labelled array .It is a primary buliding block of Dataframe,
#making its rows and columns.

In [2]:
import numpy as np
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':100,'b':200,'c':300}

In [5]:
#Syntax-->pandas.Series(data=None,index=None,dtype=None,name=None,copy=True or False)
#eg_1
import pandas as pd
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
type(pd.Series(my_data))

pandas.core.series.Series

In [7]:
#Series with labells
pd.Series(data=my_data,index=labels)
#or
pd.series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=[print,len,sum])

0    <built-in function print>
1      <built-in function len>
2      <built-in function sum>
dtype: object

In [12]:
def decor(func):
    def inner():
        str1=func()
        return str1.upper()
    return inner

@decor

def greet():
    return"good morning"
print((greet()))

GOOD MORNING

In [14]:
ser1=pd.Series([1,2,3,4,5],["USA","India","Canada","UK","Egypt"])
ser1

USA       1
India     2
Canada    3
UK        4
Egypt     5
dtype: int64

In [15]:
ser1['USA']

1

In [16]:
ser1[0]

1

In [17]:
#access values using indexing
ser1[0:3]

USA       1
India     2
Canada    3
dtype: int64

In [18]:
ser2=pd.Series([5,6,7,8],["USA","Brazil","Canada","UK"])
ser1+ser2

Brazil     NaN
Canada    10.0
Egypt      NaN
India      NaN
UK        12.0
USA        6.0
dtype: float64

In [19]:
#To create a new data in series
ser2

USA       5
Brazil    6
Canada    7
UK        8
dtype: int64

In [20]:
ser2['china']='duplicate'
ser2

USA               5
Brazil            6
Canada            7
UK                8
china     duplicate
dtype: object

In [21]:
#DataFrame
#pd.DataFrame(datas,row_label,col_label)

In [23]:
df=pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0  1.909999  0.529573  1.235612 -0.530125
1  1.358005  0.415071 -2.126308 -1.190360
2  1.920648  2.196516  0.122437  0.165810
3  0.846591  1.065711  0.648277 -1.523049
4  1.488054 -0.303029 -0.402163 -1.139139

In [31]:
df=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['w','x','y','z'])
df

          w         x         y         z
A  0.678273  0.199769 -1.656381 -0.691978
B -1.545973  0.604795  2.113241 -0.356914
C  0.559571 -1.458435  0.507670  0.120042
D -0.734461  1.313855 -1.825820  0.083079
E -0.393511  0.224873  0.725181  0.491304

In [30]:
#To convert dictionary to DataFrame
d={"col1":[1,2],"col2":[3,40],"col3":[5,6]}
print(d)
df=pd.DataFrame(d,['row1','row2'])
print("\n",df)

{'col1': [1, 2], 'col2': [3, 40], 'col3': [5, 6]}

       col1  col2  col3
row1     1     3     5
row2     2    40     6

In [33]:
df.T

          A         B         C         D         E
w  0.678273 -1.545973  0.559571 -0.734461 -0.393511
x  0.199769  0.604795 -1.458435  1.313855  0.224873
y -1.656381  2.113241  0.507670 -1.825820  0.725181
z -0.691978 -0.356914  0.120042  0.083079  0.491304

In [35]:
df.index#-->to get all the row names
df.columns
type(df)

pandas.core.frame.DataFrame

In [36]:
df.dtypes

w    float64
x    float64
y    float64
z    float64
dtype: object

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   w       5 non-null      float64
 1   x       5 non-null      float64
 2   y       5 non-null      float64
 3   z       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [38]:
df.values

array([[ 0.67827257,  0.199769  , -1.65638055, -0.69197827],
       [-1.54597268,  0.60479513,  2.11324105, -0.35691387],
       [ 0.55957111, -1.45843466,  0.50766997,  0.1200417 ],
       [-0.73446142,  1.31385464, -1.82582042,  0.08307917],
       [-0.39351067,  0.22487278,  0.72518053,  0.49130382]])

In [39]:
df.axes

[Index(['A', 'B', 'C', 'D', 'E'], dtype='object'),
 Index(['w', 'x', 'y', 'z'], dtype='object')]

In [40]:
df.ndim

2

In [41]:
df.size

20

In [42]:
#To access specific column in df
df['w']

A    0.678273
B   -1.545973
C    0.559571
D   -0.734461
E   -0.393511
Name: w, dtype: float64

In [43]:
type(df['w'])

pandas.core.series.Series

In [45]:
#to access multiple columns
df[['w','x','y']]

          w         x         y
A  0.678273  0.199769 -1.656381
B -1.545973  0.604795  2.113241
C  0.559571 -1.458435  0.507670
D -0.734461  1.313855 -1.825820
E -0.393511  0.224873  0.725181

In [46]:
#To create new column
df['new']=df['w']+df['y']
df

          w         x         y         z       new
A  0.678273  0.199769 -1.656381 -0.691978 -0.978108
B -1.545973  0.604795  2.113241 -0.356914  0.567268
C  0.559571 -1.458435  0.507670  0.120042  1.067241
D -0.734461  1.313855 -1.825820  0.083079 -2.560282
E -0.393511  0.224873  0.725181  0.491304  0.331670

In [47]:
df.drop('new',axis=1)#to delete new temporarily

          w         x         y         z
A  0.678273  0.199769 -1.656381 -0.691978
B -1.545973  0.604795  2.113241 -0.356914
C  0.559571 -1.458435  0.507670  0.120042
D -0.734461  1.313855 -1.825820  0.083079
E -0.393511  0.224873  0.725181  0.491304

In [48]:
df

          w         x         y         z       new
A  0.678273  0.199769 -1.656381 -0.691978 -0.978108
B -1.545973  0.604795  2.113241 -0.356914  0.567268
C  0.559571 -1.458435  0.507670  0.120042  1.067241
D -0.734461  1.313855 -1.825820  0.083079 -2.560282
E -0.393511  0.224873  0.725181  0.491304  0.331670

In [50]:
df.drop('new',axis=1,inplace=True)#to delete new permanently
df

          w         x         y         z
A  0.678273  0.199769 -1.656381 -0.691978
B -1.545973  0.604795  2.113241 -0.356914
C  0.559571 -1.458435  0.507670  0.120042
D -0.734461  1.313855 -1.825820  0.083079
E -0.393511  0.224873  0.725181  0.491304

In [51]:
df

          w         x         y         z
A  0.678273  0.199769 -1.656381 -0.691978
B -1.545973  0.604795  2.113241 -0.356914
C  0.559571 -1.458435  0.507670  0.120042
D -0.734461  1.313855 -1.825820  0.083079
E -0.393511  0.224873  0.725181  0.491304